#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

data.archive_file.bot: Reading...
data.archive_file.bot: Read complete after 0s [id=6b0c6b621dd1e5557049f77c0ffbc23f983afb85]
data.google_secret_manager_secret_version.line_bot_channel_access_token: Reading...
data.google_secret_manager_secret_version.line_bot_channel_secret: Reading...
data.google_secret_manager_secret_version.line_bot_channel_access_token: Read complete after 0s [id=projects/900543910035/secrets/lineBotChannelAccessToken/versions/1]
data.google_secret_manager_secret_version.line_bot_channel_secret: Read complete after 0s [id=projects/900543910035/secrets/lineBotChannelSecret/versions/1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloudfunctions_function.bot_webhook will be created
  + resource "google_cloudfunctions_function" "bot_webhook" {
      + available_memory_mb           = 128
      + description                   = "Handle LINE Bot webhook"
      + docker_registry               = (known after apply)
      + entry_point                   = "HandleWebhook"
      + environment_variables         = {
          + "CHANNEL_ACCESS_TOKEN" = (sensitive value)
          + "CHANNEL_SECRET"       = (sensitive value)
          + "FE_BASE_URL"          = "https://haraiai.netlify.app"
          + "PACKAGE_BASE_PATH"    = "/workspace/serverless_function_source_code"
          + "PHASE"                = "production"
          + "PROJECT_ID"           = "haraiai"
          + "TZ"                   = "Asia/Tokyo"
        }
      + https_trigger_security_level  = (known after apply)
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = 3
      + min_instances                 = 0
      + name                          = "BotWebhookHandler"
      + project                       = (known after apply)
      + region                        = (known after apply)
      + runtime                       = "go119"
      + service_account_email         = (known after apply)
      + source_archive_bucket         = "haraiai-bucket"
      + source_archive_object         = "func/bot.e718b59cfd22b121e4e7f6306eb2571b.zip"
      + timeout                       = 10
      + trigger_http                  = true
      + vpc_connector_egress_settings = (known after apply)
    }

  # google_cloudfunctions_function_iam_member.webhook_invoker will be created
  + resource "google_cloudfunctions_function_iam_member" "webhook_invoker" {
      + cloud_function = "BotWebhookHandler"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = "allUsers"
      + project        = (known after apply)
      + region         = (known after apply)
      + role           = "roles/cloudfunctions.invoker"
    }

  # google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "haraiai-bucket"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket_object.bot will be created
  + resource "google_storage_bucket_object" "bot" {
      + bucket         = "haraiai-bucket"
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "func/bot.e718b59cfd22b121e4e7f6306eb2571b.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "tmp/bot.zip"
      + storage_class  = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + function_bot_webhook_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @raahii, Action: `pull_request`*